# CopingWarningExtension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures..::..CopingWarningExtension Property
BuiltInFailures..::..ColumnInsideWallFailures Class See Also
---
Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopingWarningExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopingWarningExtension As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopingWarningExtension {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace